KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WB55_CM0P.svd
        <register>
          <name>C2APB2ENR</name>
          <displayName>C2APB2ENR</displayName>
          <description>CPU2 APB2ENR</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>USART1EN</name>
              <description>CPU2 USART1clock enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI1EN</name>
              <description>CPU2 SPI1 clock enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM1EN</name>
              <description>CPU2 TIM1 timer clock enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADCEN</name>
              <description>CPU2 ADC clock enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2APB3ENR</name>
          <displayName>C2APB3ENR</displayName>
          <description>CPU2 APB3ENR</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BLEEN</name>
              <description>CPU2 BLE interface clock               enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2AHB1SMENR</name>
          <displayName>C2AHB1SMENR</displayName>
          <description>CPU2 AHB1 peripheral clocks enable in Sleep           and Stop modes register</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00011207</resetValue>
          <fields>
            <field>
              <name>TSCSMEN</name>
              <description>CPU2 Touch Sensing Controller clocks               enable during Sleep and Stop modes</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRCSMEN</name>
              <description>CPU2 CRCSMEN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1SMEN</name>
              <description>SRAM1 interface clock enable during CPU1               CSleep mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAMUXSMEN</name>
              <description>CPU2 DMAMUX clocks enable during Sleep               and Stop modes</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA1SMEN</name>
              <description>CPU2 DMA1 clocks enable during Sleep and               Stop modes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2AHB2SMENR</name>
          <displayName>C2AHB2SMENR</displayName>
          <description>CPU2 AHB2 peripheral clocks enable in Sleep           and Stop modes register</description>
          <addressOffset>0x16C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0001209F</resetValue>
          <fields>
            <field>
              <name>GPIOHSMEN</name>
              <description>CPU2 IO port H clocks enable during               Sleep and Stop modes</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOESMEN</name>
              <description>CPU2 IO port E clocks enable during               Sleep and Stop modes</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOCSMEN</name>
              <description>CPU2 IO port C clocks enable during               Sleep and Stop modes</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOBSMEN</name>
              <description>CPU2 IO port B clocks enable during               Sleep and Stop modes</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOASMEN</name>
              <description>CPU2 IO port A clocks enable during               Sleep and Stop modes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2AHB4SMENR</name>
          <displayName>C2AHB4SMENR</displayName>
          <description>CPU2 AHB4 peripheral clocks enable in Sleep and Stop modes register</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x03070000</resetValue>
          <fields>
            <field>
              <name>FLASHSMEN</name>
              <description>Flash interface clocks enable during               CPU2 sleep modes</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM2SMEN</name>
              <description>SRAM2a and SRAM2b memory interface               clocks enable during CPU2 sleep modes</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RNGSMEN</name>
              <description>True RNG clocks enable during CPU2 sleep               modes</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AES2SMEN</name>
              <description>AES2 accelerator clocks enable during               CPU2 sleep modes</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PKASMEN</name>
              <description>PKA accelerator clocks enable during               CPU2 sleep modes</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2APB1SMENR1</name>
          <displayName>C2APB1SMENR1</displayName>
          <description>CPU2 APB1SMENR1</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x85A04601</resetValue>
          <fields>
            <field>
              <name>LPTIM1SMEN</name>
              <description>Low power timer 1 clocks enable during               CPU2 Sleep mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C1SMEN</name>
              <description>I2C1 clocks enable during CPU2 Sleep               mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCAPBSMEN</name>
              <description>RTC APB clocks enable during CPU2 Sleep               mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM2SMEN</name>
              <description>TIM2 timer clocks enable during CPU2               Sleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2APB1SMENR2</name>
          <displayName>C2APB1SMENR2</displayName>
          <description>CPU2 APB1 peripheral clocks enable in Sleep           and Stop modes register 2</description>
          <addressOffset>0x17C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000021</resetValue>
          <fields>
            <field>
              <name>LPTIM2SMEN</name>
              <description>Low power timer 2 clocks enable during               CPU2 Sleep mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPUART1SMEN</name>
              <description>Low power UART 1 clocks enable during               CPU2 Sleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2APB2SMENR</name>
          <displayName>C2APB2SMENR</displayName>
          <description>CPU2 APB2SMENR</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00265800</resetValue>
          <fields>
            <field>
              <name>USART1SMEN</name>
              <description>USART1clocks enable during CPU2 Sleep               mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI1SMEN</name>
              <description>SPI1 clocks enable during CPU2 Sleep               mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM1SMEN</name>
              <description>TIM1 timer clocks enable during CPU2               Sleep mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADCMEN</name>
              <description>ADC clock enable during CPU2 CSleep mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2APB3SMENR</name>
          <displayName>C2APB3SMENR</displayName>
          <description>CPU2 APB3SMENR</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000003</resetValue>
          <fields>
            <field>
              <name>BLESMEN</name>
              <description>BLE interface clocks enable during CPU2 Sleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
